/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isascii.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: obektas <obektas@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/10/20 22:33:27 by obektas           #+#    #+#             */
/*   Updated: 2022/10/20 22:33:29 by obektas          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
 * c değişkeninin ascii olup olmadığını
 * kontrol eder.
*/

#include "libft.h"

int	ft_isascii(int c)
{
	return (c >= 0 && c < 128);
}
